# Part I. ETL Pipeline for Pre-Processing the Files

## PLEASE RUN THE FOLLOWING CODE FOR PRE-PROCESSING THE FILES

#### Import Python packages

In [1]:
import pandas as pd
import cassandra
import re
import os
import glob
import numpy as np
import json
import csv

#### Creating list of filepaths to process original event csv data files

In [2]:
# current working directory
print(os.getcwd())

# current folder and subfolder event data
filepath = os.getcwd() + '/event_data'

# a for loop to create a list of files and collect each filepath
for root, dirs, files in os.walk(filepath):
    
# join the file path and roots with the subdirectories using glob
    file_path_list = glob.glob(os.path.join(root,'*'))
    #print(file_path_list)

/home/workspace

#### Processing the files to create the data file csv that will be used for Apache Casssandra tables

In [3]:
# initiating an empty list of rows that will be generated from each file
full_data_rows_list = [] 
    
# for every filepath in the file path list 
for f in file_path_list:

# reading csv file 
    with open(f, 'r', encoding = 'utf8', newline='') as csvfile: 
        # creating a csv reader object 
        csvreader = csv.reader(csvfile) 
        next(csvreader)
        
 # extracting each data row one by one and append it        
        for line in csvreader:
            #print(line)
            full_data_rows_list.append(line) 
            
# uncomment the code below if you would like to get total number of rows 
print(len(full_data_rows_list))
# uncomment the code below if you would like to check to see what the list of event data rows will look like
print(full_data_rows_list[0])

# creating a smaller event data csv file called event_datafile_full csv that will be used to insert data into the \
# Apache Cassandra tables
csv.register_dialect('myDialect', quoting=csv.QUOTE_ALL, skipinitialspace=True)

with open('event_datafile_new.csv', 'w', encoding = 'utf8', newline='') as f:
    writer = csv.writer(f, dialect='myDialect')
    writer.writerow(['artist','firstName','gender','itemInSession','lastName','length',\
                'level','location','sessionId','song','userId'])
    for row in full_data_rows_list:
        if (row[0] == ''):
            continue
        writer.writerow((row[0], row[2], row[3], row[4], row[5], row[6], row[7], row[8], row[12], row[13], row[16]))

8056
['Barry Tuckwell/Academy of St Martin-in-the-Fields/Sir Neville Marriner', 'Logged In', 'Mohammad', 'M', '0', 'Rodriguez', '277.15873', 'paid', 'Sacramento--Roseville--Arden-Arcade, CA', 'PUT', 'NextSong', '1.54051E+12', '961', 'Horn Concerto No. 4 in E flat K495: II. Romance (Andante cantabile)', '200', '1.54328E+12', '88']

In [4]:
# check the number of rows in your csv file
with open('event_datafile_new.csv', 'r', encoding = 'utf8') as f:
    print(sum(1 for line in f))

6821

# Part II. Complete the Apache Cassandra coding portion of your project. 

## Now you are ready to work with the CSV file titled <font color=red>event_datafile_new.csv</font>, located within the Workspace directory.  The event_datafile_new.csv contains the following columns: 
- artist 
- firstName of user
- gender of user
- item number in session
- last name of user
- length of the song
- level (paid or free song)
- location of the user
- sessionId
- song title
- userId

The image below is a screenshot of what the denormalized data should appear like in the <font color=red>**event_datafile_new.csv**</font> after the code above is run:<br>

<img src="images/image_event_datafile_new.jpg">

## Begin writing your Apache Cassandra code in the cells below

#### Creating a Cluster

In [5]:
# This should make a connection to a Cassandra instance on local machine 
# (127.0.0.1)

from cassandra.cluster import Cluster
cluster = Cluster()

# To establish connection and begin executing queries, need a session
session = cluster.connect()

#### Create Keyspace

In [6]:
# Create a Keyspace 
session.execute("""
    CREATE KEYSPACE IF NOT EXISTS project 
    WITH REPLICATION = 
    { 'class' : 'SimpleStrategy', 'replication_factor' : 1 }"""
)

#### Set Keyspace

In [7]:
# Set KEYSPACE to the keyspace specified above
try:
    session.set_keyspace('project')
except Exception as e:
    print(e)

### Now we need to create tables to run the following queries. Remember, with Apache Cassandra you model the database tables on the queries you want to run.

## Create queries to ask the following three questions of the data

### 1. Give me the artist, song title and song's length in the music app history that was heard during  sessionId = 338, and itemInSession  = 4


### 2. Give me only the following: name of artist, song (sorted by itemInSession) and user (first and last name) for userid = 10, sessionid = 182
    

### 3. Give me every user name (first and last) in my music app history who listened to the song 'All Hands Against His Own'

* select artist,song,length from song_info_by_session_and_item where sessionId = 338, and itemInSession = 4;
* select artist,song,firstName,lastName from session_info_by_session_and_user where userId = 10 and sessionId = 182 order by itemInSession;
* select firstName,lastName from user_by_song_name where song='All Hands Against His Own';

### creating 3 tables:

In [8]:

creation_queries = {
#     (sessionId, itemInSession, artist, song,  length) 
    'song_info_by_session_and_item':"CREATE TABLE IF NOT exists song_info_by_session_and_item (sessionId int, itemInSession int,\
artist text,song text,  length float, PRIMARY KEY (sessionId, itemInSession));",
    
#      (userId, sessionId, firstName, lastName, song, artist)      
     'session_info_by_session_and_user': "CREATE TABLE IF NOT exists session_info_by_session_and_user \
    (userId int, sessionId int, itemInSession int, firstName text, lastName text,\
    song text, artist text, PRIMARY KEY ((userId, sessionId), itemInSession));",
    
#     (song, userid, firstName, lastName)       
    'user_by_song_name':"CREATE TABLE IF NOT exists user_by_song_name (song text, userid int, \
    firstName text, lastName text, PRIMARY KEY ((song), userId));"
    
}



for k,v in creation_queries.items():
    session.execute(f'DROP TABLE IF EXISTS project.{k}')
    session.execute(v)

### inserting values from the csv file into the tables:

In [9]:
file = 'event_datafile_new.csv'


# Insert data from CSV file
with open(file, encoding='utf8') as f:
    csvreader = csv.reader(f)
    next(csvreader)  # skip header
    for line in csvreader:
#         unpacking:
        artist, firstname, gender, iteminsession,lastname, length, level, location, sessionid, song, userid = line
        
#          'select artist, song, length from songs_length where sessionId = 338 and itemInSession = 4;'
        query = "INSERT INTO song_info_by_session_and_item (sessionId, itemInSession, artist, song,  length) VALUES (%s, %s, %s, %s, %s)"
        session.execute(query, (int(sessionid), int(iteminsession), artist, song,float(length)))
        
#          'SELECT artist,song,firstName,lastName FROM songs_history WHERE userId = 10 AND sessionId = 182'
        query = "INSERT INTO session_info_by_session_and_user (userId, sessionId, iteminsession, firstName,\
        lastName, song, artist) VALUES (%s, %s, %s, %s, %s, %s, %s)"
        session.execute(query, (int(userid), int(sessionid), int(iteminsession), firstname,lastname , song, artist))
        
#         "select firstName,lastName from songs_user where song='All Hands Against His Own';"
        query = "INSERT INTO  user_by_song_name (song, userid, firstName, lastName) VALUES (%s, %s, %s, %s)"
        session.execute(query, (song, int(userid), firstname,lastname))

#### A SELECT to verify that the data have been inserted into each table

In [10]:
## verify the data was entered into the tables
tables = creation_queries.keys()

for table in tables:
    rows = session.execute(f'select * from {table}')
    display(pd.DataFrame(list(rows[:3])))

,sessionid,iteminsession,artist,length,song
0,23,0,Regina Spektor,191.085266,The Calculation (Album Version)
1,23,1,Octopus Project,250.957916,All Of The Champs That Ever Lived
2,23,2,Tegan And Sara,180.061584,So Jealous

,userid,sessionid,iteminsession,artist,firstname,lastname,song
0,58,768,0,System of a Down,Emily,Benson,Sad Statue
1,58,768,1,Ghostland Observatory,Emily,Benson,Stranger Lover
2,58,768,2,Evergreen Terrace,Emily,Benson,Zero

                                song  userid firstname lastname
0                 Wonder What's Next      49     Chloe   Cuevas
1                In The Dragon's Den      49     Chloe   Cuevas
2  Too Tough (1994 Digital Remaster)      44    Aleena    Kirby

In [11]:
## define a function to execute quries:

def execute_query(query):
    try:
        rows = session.execute(query)
    except Exception as e:
        print(e)
    return pd.DataFrame(list(rows))

### Todo: query 1

description: a query that gives the artist, the song title and the song length based on sessionID and the item's number in the session.

In [12]:
query = 'select artist, song, length from song_info_by_session_and_item where sessionId = 338 and itemInSession = 4;'

execute_query(query)

      artist                             song      length
0  Faithless  Music Matters (Mark Knight Dub)  495.307312

### TO-DO: Query 2:

a query that gives the username, the artist, and the song based on the userID and the sessionID.

In [13]:
query = 'SELECT artist,song,firstName,lastName FROM session_info_by_session_and_user WHERE userId = 10 AND sessionId = 182'

execute_query(query)

,artist,song,firstname,lastname
0,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz
1,Three Drives,Greece 2000,Sylvie,Cruz
2,Sebastien Tellier,Kilometer,Sylvie,Cruz
3,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz

### TO-DO: Query 3:

a query that gives the user details based on the song he played.

In [14]:


query = "select firstName,lastName from user_by_song_name where song='All Hands Against His Own';"
      
execute_query(query)

    firstname lastname
0  Jacqueline    Lynch
1       Tegan   Levine
2        Sara  Johnson

### Drop the tables before closing out the sessions

In [15]:
for table in tables:
    session.execute(f'DROP TABLE IF EXISTS project.{table}')

### Close the session and cluster connection¶

In [16]:
session.shutdown()
cluster.shutdown()